package com.chige.util;


import java.util.ArrayList;
import java.util.List;

/** 正则表达式工具类
 * @author wangyc
 * @date 2021/12/9
 */
public class RegularExpUtils {
    /**
     * * 验证手机号码
     * *
     * * 移动号码段:139、138、137、136、135、134、150、151、152、157、158、159、182、183、187、188、147
     * * 联通号码段:130、131、132、136、185、186、145
     * * 电信号码段:133、153、180、189
     */
    public static void main(String[] args) {
        List<String> mobile = new ArrayList<>();
        mobile.add("13672749791");
        mobile.add("13672749741");
        mobile.add("1367274979");
        mobile.add("136727497912");
        mobile.add("13372749791");
        mobile.add("13472749791");
        mobile.add("134727497.1");
        mobile.add("14377777777");
        mobile.add("14372749791");
        mobile.add("14772749791");
        mobile.add("14572749791");
        mobile.add("14572749791");
        for (String s : mobile) {
            System.out.println("phone=" + s + " >> " + checkCellPhone(s));
        }
    }

    public static boolean checkCellPhone(String phone) {
        String regex = "^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\\d{8}$";
        return phone.matches(regex);
    }
}

/**
 * 正则表达式--验证手机号码:13[0-9]{9}
 * 实现手机号前带86或是+86的情况:^((\+86)|(86))?(13)\d{9}$
 * 电话号码与手机号码同时验证:(^(\d{3,4}-)?\d{7,8})$|(13[0-9]{9})
 * 提取信息中的网络链接:(h|H)(r|R)(e|E)(f|F)  *=  *('|")?(\w|\\|\/|\.)+('|"|  *|>)?
 * 提取信息中的邮件地址:\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*
 * 提取信息中的图片链接:(s|S)(r|R)(c|C)  *=  *('|")?(\w|\\|\/|\.)+('|"|  *|>)?
 * 提取信息中的IP地址:(\d+)\.(\d+)\.(\d+)\.(\d+)
 * 提取信息中的中国手机号码:(86)*0*13\d{9}
 * 提取信息中的中国固定电话号码:(\(\d{3,4}\)|\d{3,4}-|\s)?\d{8}
 * 提取信息中的中国电话号码（包括移动和固定电话）:(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}
 * 提取信息中的中国邮政编码:[1-9]{1}(\d+){5}
 * 提取信息中的中国身份证号码:\d{18}|\d{15}
 * 提取信息中的整数：\d+
 * 提取信息中的浮点数（即小数）：(-?\d*)\.?\d+
 * 提取信息中的任何数字  ：(-?\d*)(\.\d+)?
 * 提取信息中的中文字符串：[\u4e00-\u9fa5]*
 * 提取信息中的双字节字符串  (汉字)：[^\x00-\xff]*
 */
